INSERT INTO ts.driver (driver_nm, driver_srnm, hired_at)
VALUES ('Игорь', 'Гофман', '2012-12-12'),
       ('Стас', 'Айкакпросто', '2013-01-01'),
       ('Михаил', 'Светов', '2013-02-02'),
       ('Алексей', 'Навальный', '2014-01-14'),
       ('Владимир', 'Путин', '2021-11-20'),
       ('Дмитрий', 'Медведев', '2015-03-03'),
       ('Антон', 'Вайно', '2015-04-04'),
       ('Юрий', 'Трутнев', '2015-05-05'),
       ('Олег', 'Савельев', '2016-06-06'),
       ('Николай', 'Цуканов', '2016-07-07');

INSERT INTO ts.route (route_nm)
VALUES ('Автобус 472'),
       ('Автобус 368'),
       ('Метро D1'),
       ('Автобус 101'),
       ('Автобус 102'),
       ('Метро M2'),
       ('Автобус 103'),
       ('Автобус 104'),
       ('Метро M3'),
       ('Автобус 105');

INSERT INTO ts.stop (stop_nm, bus_flg)
VALUES ('Долгопрудная', true),
       ('Химки', true),
       ('Сходненская', true),
       ('Ховрино', true),
       ('Долгопрудная метро', false),
       ('Новодачная', false),
       ('Марк', false),
       ('Окружная', false),
       ('Пятницкая', true),
       ('Субботняя', false);

INSERT INTO ts.route_stop (route_id, stop_id, no_on_route)
VALUES (1, 1, 1), (1, 2, 2), (1, 3, 3),  -- 'Автобус 472'
       (2, 1, 1), (2, 2, 2), (2, 4, 3),  -- 'Автобус 368'
       (3, 5, 1), (3, 6, 2), (3, 7, 3), (3, 8, 4),  -- 'Метро D1'
       (4, 1, 1), (4, 9, 2), (4, 10, 3),  -- 'Автобус 101'
       (5, 2, 1), (5, 9, 2), (5, 10, 3),  -- 'Автобус 102'
       (6, 5, 1), (6, 6, 2), (6, 8, 3),  -- 'Метро M2'
       (7, 3, 1), (7, 9, 2), (7, 10, 3),  -- 'Автобус 103'
       (8, 4, 1), (8, 9, 2), (8, 10, 3),  -- 'Автобус 104'
       (9, 5, 1), (9, 7, 2), (9, 8, 3),  -- 'Метро M3'
       (10, 1, 1), (10, 9, 2), (10, 10, 3);  -- 'Автобус 105'


INSERT INTO ts.transport (driver_id, bus_flg, route_id)
VALUES (1, true, 1), (2, true, 2), (3, false, 3),
       (4, true, 4), (5, true, 5), (6, false, 6),
       (7, true, 7), (8, true, 8), (9, false, 9),
       (10, true, 10), (1, true, 1), (2, true, 2),
       (3, false, 3), (4, true, 4), (5, true, 5);

-- Insert into bus_info table
INSERT INTO ts.bus_info (transport_id, fuel, capacity, bus_no)
VALUES (1, 'petrol', 50, 'av712o'),
       (2, 'gas', 60, 'av713o'),
       (4, 'electricity', 70, 'av714o'),
       (5, 'petrol', 80, 'av715o'),
       (7, 'gas', 90, 'av716o'),
       (8, 'electricity', 100, 'av717o'),
       (10, 'petrol', 110, 'av718o'),
       (11, 'petrol', 120, 'av719o'),
       (12, 'gas', 130, 'av720o'),
       (14, 'electricity', 140, 'av721o'),
       (15, 'petrol', 150, 'av722o');

INSERT INTO ts.metro_info (transport_id, cars_cnt, capacity)
VALUES (3, 8, '800'),
       (6, 9, '900'),
       (9, 10, '1000');

INSERT INTO ts.stop_nm_history (curr_nm, uppd, stop_id)
VALUES ('Долгопрудная', '2023-01-01', 1),
       ('Дирижабельная', '1990-02-01', 1),
       ('Думерская', '1989-03-01', 3),
       ('Зумерская', '2020-03-01', 3),
       ('Сходненская', '2023-03-01', 3);
